# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-03-25 17:55:22 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: design(e), meditation(m) plot(p)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* RPG [0/0]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  A disappointing attempt at a text-based role-playing game.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-03-25 Di 17:55]
   | Headline                   | Time   |        |      |
   |----------------------------+--------+--------+------|
   | *Total time*               | *2:31* |        |      |
   |----------------------------+--------+--------+------|
   | *RPG [0/0]*                | *2:31* |        |      |
   | \_  /Components [0/0]/     |        | /2:31/ |      |
   | \_    Prompt / Shell [0/0] |        |        | 1:00 |
   | \_    Model [0/0]          |        |        | 1:31 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Prompt / Shell [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-25 Di 16:15]--[2025-03-25 Di 17:15] =>  1:00
    :END:
    I found a library that seems to do what I want, [[https://github.com/c-bata/go-prompt][go-prompt]].
*** Model [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-25 Di 15:51]--[2025-03-25 Di 16:15] =>  0:24
    CLOCK: [2025-03-25 Di 14:58]--[2025-03-25 Di 15:01] =>  0:03
    CLOCK: [2025-03-24 Mo 20:32]--[2025-03-24 Mo 21:36] =>  1:04
    :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Journal
